import Pluto from '../assets/images/cosmosPage/littlePlanets/littlePlanet.png';
import Ceres from '../assets/images/cosmosPage/littlePlanets/Ceres.png';
import Erida from '../assets/images/cosmosPage/littlePlanets/Erida.png';
import Jaumea from '../assets/images/cosmosPage/littlePlanets/Jaumea.png';
import Makemake from '../assets/images/cosmosPage/littlePlanets/Makemake.png';
import Sedna from '../assets/images/cosmosPage/littlePlanets/Sedna.png';

export const littlePlanetSet = [
  {
    img: Pluto,
    undertext: 'Плутон',
    fact: 'Крупнейшая карликовая планета ',
    description:
      'Плутон — вторая по величине карликовая планета в Солнечной системе, расположенная в зоне пояса Койпера. Ее открыл американский ученый К. Томбо в 1930 году, подтвердив более ранние предположения своего соотечественника П. Лоуэлла, который приписывал отклонения в орбитах Нептуна и Урана воздействию небесного тела. Томбо не стал присваивать имя своему открытию, предоставив это право соратникам и друзьям Лоуэлла. Из множества вариантов выбрали название Плутон, автором которого стала 11-летняя англичанка В. Берни. Девочка сочла имя бога Царства мертвых из римской мифологии весьма подходящим для самой удаленной от Солнца планеты.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,3 × 10^22 кг',
      },
      {
        key: 'Диаметр',
        value: '2 374 км',
      },
      {
        key: 'Плотность',
        value: '1,86 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '44,5 °C',
      },
    ],
    intrestingFactsList: [
      'Период обращения вокруг Солнца составляет 248 лет.',
      'Период вращения вокруг своей оси составляет 153,3 дня.',
      'Звездная величина планеты, находящейся почти в 50 раз дальше от Солнца, чем Земля, составляет около 15,1. С территории Земли он видится точкой светло-коричневого цвета даже в самый сильный телескоп.',

      'Предположительно, поверхность планеты состоит из скал, покрытых льдом, а ее атмосфера содержит азот, углерод и метан. Температура не поднимается выше –240°С.',
      'Еще совсем недавно Плутон был полноправным 9-м членом Солнечной системы: по массе планета считалась приблизительно одинаковой с Землей. Но новые исследования показали, что в действительности она составляет меньше ее четверти, а диаметр планеты — около 2500 км.',
      'Эти данные стали основной причиной того, что в 2006 г. МАС причислил Плутон к планетам-карликам.',
      'Вокруг своей оси Плутон вращается медленно: для полного оборота ему требуется более 6 земных дней. Вращение происходит в противоположном от Земли направлении.',
      'За счет отдаленности изучение Плутона всегда было затруднено. Наиболее известные снимки получены с орбитального телескопа «Хаббл». Благодаря им удалось рассмотреть яркое пятно в районе экватора и определить, что поверхность планеты постепенно меняет свой цвет, становясь более красной.',
    ],
  },
  {
    img: Ceres,
    undertext: 'Церера',
    fact: 'Карликовая планета из Пояса астероидов ',
    description:
      'Карликовые планеты — довольно редкое астрономическое явление. Одна из них, Церера, расположилась в известном Астероидном поясе, почти посередине между Марсом и Юпитером. Ее открытие в 1801 г. принадлежит итальянскому астроному Дж. Пьяцци. Изначально ученый принял небесное тело за комету, но потом обнаружил, что оно гораздо массивнее и имеет другие отличительные признаки. Свое название планета-карлик получила в честь римской богини плодородия Цереры, хотя состоит в основном из скал и ледяных глыб.ыла открыта в 1930 году американским астрономом Клиффордом Стэрлингом. Плутон — это не планета, а маленькая планета, или «королевский спутник». Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна. Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '9,39 × 10^20 кг',
      },
      {
        key: 'Диаметр',
        value: '950 км',
      },
      {
        key: 'Плотность',
        value: '2,16 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-106 °C',
      },
    ],
    intrestingFactsList: [
      'Долгое время Церера считалась самым массивным из астероидов. Но в 2006 году МАС выделил новый класс небесных объектов — карликовые планеты и отнес ее к этой категории.',
      'Блеск Цереры достигает почти 7 звездной величины, поэтому ее можно увидеть с помощью телескопа.',
      'Планета перемещается по слегка наклоненной орбите, в разные периоды находясь в диапазоне от 380 до 445 млн. км от Солнца. Ее орбитальный путь — очень короткий: всего 4,5 года.',
      'В 2007 г. НАСА запустила аппарат «Рассвет», который достиг орбиты Цереры к 2015 г. и стал постепенно снижаться, делая снимки. На них обнаружились загадочные светлые пятна, вызвавшие споры об их происхождении. Одно из предположений сводилось к тому, что они могут быть строениями космических пришельцев.',
      'иаметр Цереры по современным расчетам составляет около 950 км, ее масса — 0,00016 относительно Земли. Это самая маленькая планета-карлик.',
    ],
  },
  {
    img: Jaumea,
    undertext: 'Хаумеа',
    fact: 'Крупнейшая карликовая планета',
    description:
      'Карликовая планета Хаумеа находится в зоне известного пояса Койпера, расположенного за орбитой Нептуна. Она занимает 4-е место по размеру среди известных планет-карликов. Земляне узнали о существовании Хаумеи совсем недавно — в 2005 году. Право считаться первооткрывателями делят между собой две группы ученых: американские астрономы (под руководством Майкла Брауна) и испанцы (руководитель Хосе Ортис). Они практически одновременно обнаружили новый небесный объект. Некоторое время планета не имела своего имени, обозначаясь лишь буквенно-цифровым кодом. Затем ей дали название в честь гавайской богини плодородия. Открытые в том же 2005 году спутники получили имена дочерей Хаумеи: Намака (дух воды) и Хииака (покровительница танцоров).',
    characteristicsList: [
      {
        key: 'Масса',
        value: '4 × 10^21 кг',
      },
      {
        key: 'Диаметр',
        value: '1212-1491 км',
      },
      {
        key: 'Плотность',
        value: '2,6 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-233 °C',
      },
    ],
    intrestingFactsList: [
      'Хаумеа является чемпионкой по скорости вращения вокруг своей оси: ее сутки составляют меньше 4-х земных часов.',
      'Чтобы облететь вокруг Солнца, планете необходимо почти 284 земных года. Диапазон удаленности от светила составляет от 5 до 8 млрд. км.',
      'Хаумеа — достаточно заметный в космосе объект с высокой степенью яркости. По последним данным, ее видимый блеск равен 17,2 m.',
      'Хаумеа обладает необычной, слегка сплюснутой формой, напоминающей яйцо.',
      'Ученые считают, что несколько миллиардов лет назад произошла катастрофа: в Хаумеа врезался какой-то небесный объект, который изменил ее форму, придал необычную скорость вращения и создал оба спутника. Это же объясняет и ее плотность, которая несколько выше, чем у других карликовых планет.',
      'В 2017 году возле карликовой планеты были обнаружены полупрозрачные газопылевые кольца.',
    ],
  },
  {
    img: Erida,
    undertext: 'Эрида',
    fact: 'Вторая по размеру карликовая планета Солнечной системы',
    description:
      'Эрида — вторая по величине карликовая планета, относящаяся к ТНО (транснептунианским объектам). Она расположена за орбитой Плутона в зоне пояса Койпера. Изучение небесных тел в этом поясе послужило толчком к изменению привычной классификации: в нее добавились объекты типа «плутоиды». К ним, после долгих споров, была отнесена и Эрида, обнаруженная в 2003 году группой американских астрономов под руководством М. Брауна. Официально об открытии сообщили в 2005 г. Команда Брауна прозвала новую планету-карлика Зеной, в честь прекрасной и воинственной героини известного сериала. В качестве названия предлагались и другие варианты, но победила богиня раздора Эрида из греческих мифов. Планета находится очень далеко от Солнца, что затрудняет изучение ее физических показателей. К тому же измерениям сильно мешает атмосфера Плутона. Но некоторые секреты загадочной планеты астрономам все же удалось выяснить.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,67 × 10^22 кг',
      },
      {
        key: 'Диаметр',
        value: '2326 км',
      },
      {
        key: 'Плотность',
        value: '2,52 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-253 °C',
      },
    ],
    intrestingFactsList: [
      'Орбита карликовой планеты имеет наклон почти в 45°. Она не входит в контакт с Нептуном и не испытывает его влияния.',
      'Эрида приближается к Солнцу и удаляется от него в диапазоне от 5,7 до 14,5 млрд. км. Таким образом, один оборот вокруг светила занимает более 560 земных лет.',
      'Собственную скорость вращения нового плутоида долго не могли определить. Изначально считалось, что она очень медленная: до нескольких суток. Но затем ученые точнее вычислили период обращения, составивший всего около 26 земных часов.',
      'По размеру Эрида практически равна Плутону, но ее масса почти на 25% больше. Средняя плотность (2,5 кг/см³) примерно сопоставима с остальными объектами пояса Койпера.',
      'Планета имеет сферическую форму. Ее поверхность состоит из камня и льда, содержащего газы: этан и метан. Температура варьируется в зависимости от близости нахождения к Солнцу: от –250°С до –230°С.',
      'Несмотря на свою отдаленность, Эрида сияет ярче Плутона. Ее видимый блеск — более 18 m, а отражающая способность (альбедо) — 0,95, что является высоким показателем.',
    ],
  },
  {
    img: Makemake,
    undertext: 'Макемаке',
    fact: 'Третья по величине карликовая планета Солнечной системы',
    description:
      'Планета-карлик Макемаке расположилась на самой окраине Солнечной Системы, в поясе Койпера. Лишь в 2005 году она была замечена группой американских астрономов под руководством М. Брауна, проводивших исследования в обсерватории на горе Паломар. К этому моменту было известно уже несколько карликовых планет, но именно открытие Макемаке побудило ученых пересмотреть прежнее определение понятия «планета», добавив в классификацию новую группу. Несколько лет небесное тело обозначали кодом, а иногда называли Пасхальным Кроликом, ведь оно было замечено сразу после празднования Пасхи. И только в 2008-м, после официального признания МАС, Макемаке одарили названием в честь бога изобилия аборигенов острова Пасхи. Таким образом удалось сохранить и некую связь с христианским праздником.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '3 × 10^21 кг',
      },
      {
        key: 'Диаметр',
        value: '1430-1502 км',
      },
      {
        key: 'Плотность',
        value: '1,7±0.3 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-240 °C',
      },
    ],
    intrestingFactsList: [
      'Макемаке занимает 3-е место в списке карликовых планет-плутоидов. Она обладает сферической формой и диаметром более 1450 км.',
      'Планета приближается и удаляется от Солнца в диапазоне от 5,5 до 8 млрд. км. Чтобы совершить полный оборот вокруг светила, ей необходимо около 308 лет. На осевой оборот Макемаке тратит 7,8 земных часов.',
      'Макемаке признана 2-й по яркости в поясе Койпера, уступая только Плутону. По данным 2012 года, ее видимый блеск равняется почти 17 m.',
      'Изначально предполагалось, что планета обладает собственной атмосферой, но новые исследования не подтвердили этого. Поверхность Макемаке почти полностью покрыта снегом и льдом, содержащими азот, этан и метан.',
      'Когда планета приближается к Солнцу, замороженные газы нагреваются и создают временный атмосферный слой. Он сохраняется, пока Макемаке находится в «теплой» зоне. При удалении от светила газы постепенно снова замерзают и зернистыми хлопьями падают на поверхность.',
      'Красновато-коричневый цвет карлика говорит о присутствии толинов — органических молекул, которые образуются при взаимодействии с ультрафиолетом.',
    ],
  },
  {
    img: Sedna,
    undertext: 'Седна',
    fact: 'Транснептуновый объект, один из претендентов на статус карликовой планеты',
    description:
      'Седна была открыта в 2003 году, но об ее космическом «статусе» до сих пор ведутся споры. Большинство ученых склонны считать ее транснептуновым объектом (ТНО). Таково же и официальное мнение МАС. Но некоторые исследователи предпочитают называть Седну карликовой планетой. Открытие принадлежит команде американского астронома М. Брауна, который обнаружил также Хаумеа, Эриду и другие планеты-карлики, расположенные в поясе Койпера. Седна — более отдаленный объект, она «живет» в Облаке Оорта, на расстоянии более 100 а.е. от Солнца. Свое название получила по инициативе первооткрывателей, которые сочли уместным дать холодной далекой планете имя эскимосской богини морей. Ученые считают, что исследование Седны принесет много ценных сведений о происхождении и эволюционном развитии Солнечной системы. Поэтому ее изучают с помощью лучших наземных и орбитальных телескопов.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '8,3 × 10^20 кг',
      },
      {
        key: 'Диаметр',
        value: '995±80 ',
      },
      {
        key: 'Плотность',
        value: '2,0 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-237,6 °C',
      },
    ],
    intrestingFactsList: [
      'Седна удалена от Солнца на 145 млрд. км, это в 2 раза дальше Плутона и почти в 950 раз Земли.',
      'Предположительно, она обходит светило за 10–12 тыс. лет. Ближайшая точка приближения составляет почти 80 а.е., самая отдаленная — 935 а.е.',
      'Орбита небесного тела сильно вытянута и наклонена под углом в 12°. По расчетам, сделанным в разные годы, верхняя граница ее диаметра колебалась от 1000 до 1800 км. Сегодня считается, что она наполовину меньше Плутона.',
      'Поверхность планеты состоит из большого количества жидкости (до 70% от общей массы) в виде воды и льда. Спектральный анализ показал также присутствие азота, углерода и метана.',
      'На сегодняшний день у Седны не обнаружено спутников, поэтому рассчитать ее массу хотя бы приблизительно не представляется возможным.',
      'Однородный красный цвет поверхности объясняется присутствием толина — смеси распавшейся под воздействием ультрафиолета органики.',
    ],
  },
];
