import Pluto from '../assets/images/cosmosPage/littlePlanets/littlePlanet.png';
import Ceres from '../assets/images/cosmosPage/littlePlanets/Ceres.png';
import Erida from '../assets/images/cosmosPage/littlePlanets/Erida.png';
import Jaumea from '../assets/images/cosmosPage/littlePlanets/Jaumea.png';
import Makemake from '../assets/images/cosmosPage/littlePlanets/Makemake.png';
import Sedna from '../assets/images/cosmosPage/littlePlanets/Sedna.png';

export const littlePlanetSet = [
  {
    img: Pluto,
    undertext: 'Плутон',
    fact: 'Плутон — самая удалённая планета Солнечной системы. ',
    description:
      'Плутон — самая удалённая планета Солнечной системы. Она была открыта в 1930 году американским астрономом Клиффордом Стэрлингом. Плутон — это не планета, а маленькая планета, или «королевский спутник». Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна. Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,3 × 1022 кг',
      },
      {
        key: 'Радиус',
        value: '1 188 км',
      },
      {
        key: 'Плотность',
        value: '2,0 г/см³',
      },
      {
        key: 'Средняя температура поверхности',
        value: '44,5 °C',
      },
    ],
    intrestingFactsList: [
      'Период обращения вокруг Солнца составляет 248 лет.',
      'Период вращения вокруг своей оси составляет 153,3 дня.',
    ],
  },
  {
    img: Ceres,
    undertext: 'Церера',
    fact: 'Плутон — самая удалённая планета Солнечной системы. ',
    description:
      'Плутон — самая удалённая планета Солнечной системы. Она была открыта в 1930 году американским астрономом Клиффордом Стэрлингом. Плутон — это не планета, а маленькая планета, или «королевский спутник». Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна. Плутон — это самый удалённый объект, который мы знаем в Солнечной системе. Плутон находится на расстоянии 5,9 миллиардов километров от Солнца. Это больше, чем расстояние от Солнца до Нептуна.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,3 × 1022 кг',
      },
      {
        key: 'Радиус',
        value: '1 188 км',
      },
      {
        key: 'Плотность',
        value: '2,0 г/см³',
      },
      {
        key: 'Средняя температура поверхности',
        value: '44,5 °C',
      },
    ],
    intrestingFactsList: ['Период обращения вокруг Солнца составляет 248 лет.'],
  },
  {
    img: Jaumea,
    undertext: 'Хаумеа',
  },
  {
    img: Erida,
    undertext: 'Эрида',
  },
  {
    img: Makemake,
    undertext: 'Макемаке',
  },
  {
    img: Sedna,
    undertext: 'Седна',
  },
];
