import Earth from '../assets/images/cosmosPage/planets/earth.png';
import Jupiter from '../assets/images/cosmosPage/planets/Jupiter.png';
import Mars from '../assets/images/cosmosPage/planets/Mars.png';
import Mercury from '../assets/images/cosmosPage/planets/Mercury.png';
import Neptune from '../assets/images/cosmosPage/planets/Neptune.png';
import Saturn from '../assets/images/cosmosPage/planets/Saturn.png';
import Uranus from '../assets/images/cosmosPage/planets/Uranus.png';
import Venus from '../assets/images/cosmosPage/planets/Venus.png';

export const planetSet = [
  {
    img: Earth,
    undertext: 'Земля',
    fact: 'Третья планета от Солнца',
    description:
      'Наша планета состоит из сложных и еще до конца не изученных систем: земли, воды и воздуха. От пустынного, безжизненного, но манящего и загадочного космоса нас отделяет атмосферный слой. Первые формы жизни зародились на Земле более 3 млрд. лет назад, планета же образовалась еще раньше. Само слово «земля» очень старое, праиндоевропейское. Основной перевод — «низкий». Скорее всего, такое название возникло в те времена, когда считалось, что Земля плоская, низкая и стоит на трех китах. Сейчас уже никого не удивляет то, что «планета круглая, планета вертится». Все знают, что у Земли единственный спутник — Луна. Исследования Земли из космоса активно ведутся, поэтому с каждым годом раскрывается все больше «тайн третьей планеты».',
    characteristicsList: [
      {
        key: 'Масса',
        value: '5,98 × 10^24 кг',
      },
      {
        key: 'Диаметр',
        value: '12742 км',
      },
      {
        key: 'Плотность',
        value: '5,52 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -89 до +58 °C',
      },
    ],
    intrestingFactsList: [
      'Смена времен года объясняется наклоном оси вращения на 24 градуса.',
      'За погоду на планете отвечает распределяемый в атмосфере водяной пар.',
      'В центре Земли — расплавленное ядро из железа и никеля.',
      'На орбите самое большое количество космических аппаратов.',
      'Магнитное поле вместе с озоновым слоем защищают нас от пагубной космической радиации.',
      'Плотность выше, чем у остальных планет.',
      'Скорость вращения замедляется с каждым годом.',
      'Океаны занимают 70% поверхности Земли.',
    ],
  },
  {
    img: Jupiter,
    undertext: 'Юпитер',
    fact: 'Пятая планета от Солнца',
    description:
      'Эта планета — самая большая из всех известных. Юпитер замыкает цепочку планет земной группы и начинает семейство газовых гигантов. Его масса чрезвычайно велика, поэтому на орбите были образованы многочисленные спутники, 63 из них точно установлены. Планета — вторая по яркости после Венеры, поэтому можно лицезреть небесное тело без телескопа. Своим названием Юпитер обязан могущественному древнеримскому богу. Греки называли планету Зевсом также в честь величественного предводителя их «небесной канцелярии».',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,9 × 10^27 кг',
      },
      {
        key: 'Диаметр',
        value: '143000 км',
      },
      {
        key: 'Плотность',
        value: '1,32 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '+130 °C',
      },
    ],
    intrestingFactsList: [
      'Здесь самый короткий день в сравнении с другим планетами.',
      'Юпитер окружен тонкими кольцами.',
      'На планете побывали 8 научно-исследовательских систем.',
      'У небесного тела сильное магнитное поле.',
      'Будучи в 80 раз массивнее, Юпитер мог бы стать звездой.',
      'У планеты больше всего спутников.',
      'Плотность спутников уменьшается по мере отдаления от планеты по орбите.',
      'Его облака на 95% состоят из аммиака.',
      'На планете бушует длительный и мощный шторм Большое Красное Пятно.',
      'Здесь есть вода.',
    ],
  },
  {
    img: Mars,
    undertext: 'Марс',
    fact: 'Четвёртая планета от Солнца',
    description:
      'Свое название небесное тело получило еще в Древнем Риме в честь бога войны Марса, благодаря ярко-красному цвету, напоминающему кровь и огонь. Названия спутников Деймоса и Фобоса переводятся как «ужас» и «страх», что вполне соответствует духу «бога войны». Марс небольшой, и на нем скалистый рельеф. До недавнего времени считалось, что Марс очень похож на Землю. Предполагается, что климат здесь менялся несколько раз, вероятно, были или есть зачатки жизни. Сейчас на планете часто происходят песчаные бури, после которых образуются дюны и выветренные поверхности, на первый взгляд напоминающие некоторые районы Земли. Планета Марс еще откроет свои загадки миру. В 2023 году ожидается экспедиция «в один конец» добровольцев с Земли. Это необычная и смелая миссия, заслуживающая уважения и почтения. ',
    characteristicsList: [
      {
        key: 'Масса',
        value: '6.41 × 10^23 кг',
      },
      {
        key: 'Диаметр',
        value: '6772 км',
      },
      {
        key: 'Плотность',
        value: '3,39 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -153 до +30 °C',
      },
    ],
    intrestingFactsList: [
      'Здесь есть сезоны, как и на Земле.',
      'Год на Марсе длится 2 земных года (687 дней), сутки — 24 часа и 37 минут.',
      'Прежде красная планета подвергалась ударам астероидов',
      'Присутствуют следы от некрупных рек.',
      'Сейчас на планете вода есть только в виде льда.',
      'Здесь находится Олимп — легендарная гора богов высотой около 28 тысяч метров.',
      'Отсутствует магнитное поле.',
      'На Марсе происходят самые сильные в Солнечной системе пылевые бури.',
      'На Землю иногда прилетает марсианский мусор.',
    ],
  },
  {
    img: Mercury,
    undertext: 'Меркурий',
    fact: 'Первая планета от Солнца',
    description:
      'Меркурий расположен к Солнцу ближе остальных планет. У него особенно яркое свечение, поэтому можно обнаружить его на звёздном небе без специализированной техники. Он интересует пытливые умы с незапамятных времен. Свое название Меркурий получил в честь одноименного быстроногого римского бога за высокую скорость вращения. Есть мнение, что раньше планета была спутником Венеры, однако мощный взрыв-катастрофа стал причиной ее отделения. Астрономы выдвинули предположение об огромном ядре внутри планеты, но в случае, если это действительно так, Меркурий просто не мог быть спутником. Первое изображение космического тела было получено в середине ХХ века. Однако орбиты Меркурия удалось достигнуть только в 2011 году. Тогда и были получены ответы на многие вопросы о поверхности, физических свойствах и атмосфере планеты.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '3,3 × 10^23 кг',
      },
      {
        key: 'Диаметр',
        value: '4879 км',
      },
      {
        key: 'Плотность',
        value: '5,43 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -180 до +430 °C',
      },
    ],
    intrestingFactsList: [
      'Один год на Меркурии равен 88 земным месяцам.',
      'Протяженность орбиты — 360 млн. км.',
      'Вращается со скоростью 48 км/сек (быстрее остальных планет).',
      'В 2,5 раза Меркурий меньше Земли, но в 1,5 раза больше Луны.',
      'На поверхности есть кратеры, ущелья и горы.',
      'Отсутствует атмосфера.',
      'Меркурий несколько раз за столетие проходит сквозь солнце.',
      'Венера закрывает планету полностью 1 раз в 150–400 лет.',
    ],
  },
  {
    img: Neptune,
    undertext: 'Нептун',
    fact: 'Восьмая планета от Солнца',
    description:
      'Восьмая от Солнца планета, которая замыкает группу газовых гигантов. Ее открыли относительно поздно — в 19 веке. Ученые заметили нехарактерное для звезд и комет вращение, установили, что это планетарное тело на солнечной орбите. Благодаря яркому синему оттенку космический объект нарекли в честь царя морей — бога древнеримской мифологии Нептуна. Рассмотреть планету невооруженным взглядом невозможно, однако мощное оборудование позволит в полной мере насладиться видами Нептуна на звездном небе. ',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,02 × 10^26 кг',
      },
      {
        key: 'Диаметр',
        value: '50538 км',
      },
      {
        key: 'Плотность',
        value: '1,67 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-220°C',
      },
    ],
    intrestingFactsList: [
      'Имеет каменно-ледяное ядро размером с нашу Землю.',
      'Атмосфера Нептуна — переходное состояние из жидкого океана в замороженную мантию. Составляющие: вода, аммиак и метан.',
      'Путь до Нептуна займет около 14 лет.',
      'Сутки длятся 16 земных часов.',
      'Красивый синий оттенок планете придает именно метан.',
      'Самая далекая от Солнца планета (расстояние в 30 раз превышает путь от Земли до Солнца).',
      'На планете происходят гигантские вихри, из-за которых на поверхности небесного тела видны пятна.',
    ],
  },
  {
    img: Saturn,
    undertext: 'Сатурн',
    fact: 'Шестая планета от Солнца',
    description:
      'Впервые это космическое тело заметил Галилей в 17 веке. Сатурн расположен на шестой позиции от Солнца. Планета известна своей легендарной системой колец, которые видны с Земли даже без специальных технических приспособлений (в обычный телескоп). Сатурн диаметрально отличается от Земли по свойствам. Но шанс обнаружить признаки жизни велик именно на этой планете или вблизи нее. На Энцеладе, одном из спутников газового гиганта, были обнаружены гейзеры. А если есть вода, то в теории возможно и живое существование.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '5,68 × 10^26 кг',
      },
      {
        key: 'Диаметр',
        value: '120536 км',
      },
      {
        key: 'Плотность',
        value: '0,69 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-180 °C',
      },
    ],
    intrestingFactsList: [
      'Ветер в атмосфере достигает 1800 км/ч.',
      'Присутствует магнитное поле.',
      'Сутки длятся около 10–11 земных часов.',
      'Один год на Сатурне равен 29 годам на Земле.',
      'Твердой поверхности нет (на планете невозможно высадиться).',
      'Кольца вокруг планеты отражают свет сильнее, чем вся планета.',
      'Космические корабли 4 раза приближались к Сатурну.',
      'Облака ледяные, с примесями аммиака.',
      'У небесного тела сплюснутая форма.',
    ],
  },
  {
    img: Uranus,
    undertext: 'Уран',
    fact: 'Седьмая планета от Солнца',
    description:
      'Уран — первая планета, о которой узнали астрономы. Долгое время ученые следили за ней, ошибочно принимая за звезду или комету. Уильям Гершель наблюдал за небесным телом в течение года и в 1781 году установил, что оно находится на планетарной орбите Солнца. Уран единственный получил свое название из греческой, а не римской мифологии. Планету нарекли в честь одноименного бога неба.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '8,68 × 10^25 кг',
      },
      {
        key: 'Диаметр',
        value: '51118 км',
      },
      {
        key: 'Плотность',
        value: '1,27 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-210 °C',
      },
    ],
    intrestingFactsList: [
      'Ось наклонена почти под 100-градусным углом (планета «лежит на боку»).',
      'Сутки длятся около 17 земных часов, год — почти 85 земных лет.',
      'Расположен на седьмой орбите.',
      'Самая холодная планета Солнечной системы.',
      'По величине уступает только Юпитеру и Сатурну.',
      'Движется по орбите против часовой стрелки.',
      'Отсутствует твёрдая поверхность, оболочка — газообразная, с примесью метана, аммиака и льда.',
      'Магнитное поле схоже с земным (есть вероятность полярных сияний).',
      'Температура ледяного ядра достигает 7000 градусов.',
      'Облака содержат много метана, который придает планете красивый сине-зеленый оттенок.',
    ],
  },
  {
    img: Venus,
    undertext: 'Венера',
    fact: 'Вторая планета от Солнца',
    description:
      'Первые исследования планеты сделал Галилей. Он же официально открыл ее в 1610 году. Раньше астрономы считали Венеру двойником Земли ввиду схожего состава, размера и массы. Но позже выяснилось, что остальные параметры резко отличаются и «сестрами» эти космические представительницы быть не могут. В 1961 году на орбите планеты побывал наш космический корабль «Венера-1». Венера — вторая от Солнца и самая горячая планета (температура поверхности прогревается почти до 500 градусов). Она же и самая яркая из-за близости к земле и способности облаков отражать солнечный свет. Возможно, именно поэтому ее назвали в честь римской богини любви.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '4,87 × 10^24 кг',
      },
      {
        key: 'Диаметр',
        value: '12104 км',
      },
      {
        key: 'Плотность',
        value: '5,24 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'около +475 °C',
      },
    ],
    intrestingFactsList: [
      'Давление на планете сильнее почти в 100 раз, чем на Земле.',
      'Отсутствуют водоемы, флора и фауна.',
      'Атмосфера состоит почти на 97% из углекислого газа.',
      'Венера способна отбрасывать тень на землю.',
      'Облака на планете имеют в составе серную кислоту и способны растворять алмазы и цинк.',
      'Около 90% поверхности планеты — застывшая вулканическая лава.',
      'Самая высокая вершина достигает более 11 км.',
      'Из-за инертной атмосферы отсутствует разница между дневными и ночными температурами.',
      'Один день на Венере равен 117 земным суткам.',
      'Здесь частые грозы.',
    ],
  },
];
