import Io from '../assets/images/cosmosPage/satellites/sputnik.png';
import Callisto from '../assets/images/cosmosPage/satellites/Callisto.png';
import Europe from '../assets/images/cosmosPage/satellites/Europe.png';
import Ganymede from '../assets/images/cosmosPage/satellites/Ganymede.png';
import Mimas from '../assets/images/cosmosPage/satellites/Mimas.png';
import Moon from '../assets/images/cosmosPage/satellites/Moon.png';
import Phobos from '../assets/images/cosmosPage/satellites/Phobos.png';
import Tefia from '../assets/images/cosmosPage/satellites/Tefia.png';
import Titan from '../assets/images/cosmosPage/satellites/Titan.png';

export const satelliteSet = [
  {
    img: Moon,
    undertext: 'Луна',
    fact: 'Спутник Земли',
    description:
      'Луна — самое изученное землянами небесное тело. Она привлекала человечество с древних времен как самый заметный (не считая Солнца) объект на небосводе. Луне приписывались мистические свойства, люди издавна поклонялись ей, сложив множество мифов и легенд. Русские и латинские корни названия очень схожи: в обоих языках слово означает «светлая». Греки именовали светило очень созвучно — Селеной. С развитием науки у людей возникло желание не только любоваться, но и изучать небесное тело. В 17-м веке, когда был изобретен телескоп, впервые появилась возможность подробно рассмотреть Луну, а в середине 20-го на нее уже высадился десант американских астронавтов. Благодаря исследованиям ученых и космическим полетам сегодня о Луне известно много. Но остались и загадки, которые еще ждут своих исследователей.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '7,3 × 10^22 кг',
      },
      {
        key: 'Диаметр',
        value: '3474 км',
      },
      {
        key: 'Плотность',
        value: '3,3 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -160 до +120 °C',
      },
    ],
    intrestingFactsList: [
      'Луна является единственным спутником нашей планеты. Среднее расстояние между небесными телами — почти 384,5 тыс. км, что составляет около 30 земных диаметров.',
      'Луна движется по сложной эллиптической орбите, совершая полный оборот за 27,3 земных дня, удаляясь от нашей планеты примерно на 5 см в год.',
      'Мощное влияние на ее движение оказывает Солнце, притягивая к себе планету более чем в 2 раза сильнее Земли.',
      'Размеры лунной орбиты изменчивы. Они колеблются в диапазоне от 407 тыс. км — при приближении к главному светилу — до 355 тыс. км — при отдалении от него.',
      'Поверхность Луны имеет серо-бурую окраску со слабыми цветовыми отличиями. На ней не существует водных пространств, но есть горы, равнины и вулканические кратеры. Многим из них люди дали свои названия.',
      'Существует 2 основных гипотезы о происхождении Луны. Одна предполагает, что спутник образовался вместе с Землей, вторая — что он возник в другом месте, но затем был захвачен притяжением нашей планеты.',
      'Планета-спутник определенным образом влияет на Землю, управляя водными пространствами, частично защищая ее от атак метеоритов и др.',
    ],
  },
  {
    img: Io,
    undertext: 'Ио',
    fact: 'Спутник Юпитера',
    description:
      'Ио — один из 4-х спутников Юпитера, открытых еще в 1610 году знаменитым астрономом Г. Галилеем. Свое сегодняшнее название, позаимствованное из греческой мифологии, он получил гораздо позже, в середине 19 века. По легенде, так звали любовницу верховного бога Зевса, одну из жриц его жены Геры, которую затем превратили в корову.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '8,9319 × 10^22 кг',
      },
      {
        key: 'Диаметр',
        value: '3642 км',
      },
      {
        key: 'Плотность',
        value: '3,528 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-160 °C',
      },
    ],
    intrestingFactsList: [
      'Ио располагается на расстоянии более 420 тыс. км от своей планеты и всегда повернута к ней одной стороной, совершая полный оборот за 42,6 земных часов.',
      'Спутник состоит из горячего железного ядра и силикатного наружного слоя. Это сильно отличает его от других, содержащих в основном лишь камень и лед.',
      'Поверхность имеет пятнистую окраску, сочетающую черный, желтый, красный, белый и другие цвета. Она включает как обширные равнины, так и более сотни гор. Некоторые из них превосходят по высоте самые высокие земные вершины.',
      'Ио — единственное (кроме Земли) вулканически активное небесное тело в Солнечной системе. На ее поверхности находится около 400 вулканов. Они выбрасывают лаву на высоту до 300 км, а ее потоки простираются до 500 км и более.',
      'Температура на поверхности достаточно низкая — около –130°С, но в зоне действия вулканов она достигает более +1500°С. Благодаря землетрясениям и вулканическим извержениям ландшафт постоянно видоизменяется.',
      'При вращении Юпитера его мощные магнитные силы уносят около 1000 кг содержимого спутника за 1 сек., создавая особое облако излучения с эффектом северного сияния.',
    ],
  },
  {
    img: Callisto,
    undertext: 'Каллисто',
    fact: 'Спутник Юпитера',
    description:
      'Юпитер богаче всех планет по количеству спутников — у него их больше шестидесяти. Среди них выделяется «галилейская группа»: 4 первых объекта, открытых еще в 1610 г. великим Г. Галилеем. К ней относится и Каллисто, самый отдаленный юпитерианский спутник. Он получил свое имя в честь возлюбленной Зевса (в римском пантеоне — Юпитера), прекрасной Каллисто, спутницы богини охоты Артемиды. Название было придумано сразу, но не получило одобрения самого Галилея. До XX века спутник, как и остальные собратья, обозначался просто римской цифрой.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,076 × 10^23 кг',
      },
      {
        key: 'Диаметр',
        value: '4820 км',
      },
      {
        key: 'Плотность',
        value: '1,834 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -198 до -103 °C',
      },
    ],
    intrestingFactsList: [
      'Спутник удален от планеты в среднем на 1 млн. 900 тыс. км. Время оборота вокруг своей оси (16,7 земных дней) совпадает с оборотом вокруг Юпитера.',
      'Каллисто имеет неоднородную окраску с яркими пятнами, но в целом она темнее других спутников этой группы. Отражающая способность очень мала — всего 20%.',
      'По расчетам ученых, ядро спутника выражено неярко, что нехарактерно для таких массивных тел.',
      'Возраст Каллисто считается примерно равным возрасту самого Юпитера — около 4,5 млрд. лет.',
      'Ее поверхностный слой очень густо покрыт кратерами, но не имеет ни гор, ни вулканов. Полное отсутствие геологической активности тоже выделяет Каллисто среди остальных спутников.',
      'Исследователи предполагают, что под толстым ледяным слоем скрыты океанические воды, которые простираются на 100–200 км и находятся в жидком состоянии из-за большого давления. Эту гипотезу подтверждает и наличие магнитного поля.',
    ],
  },
  {
    img: Europe,
    undertext: 'Европа',
    fact: 'Спутник Юпитера',
    description:
      'Европа — самый маленький из 4-х спутников Юпитера, обнаруженных в 17 веке знаменитым Г. Галилеем. Ученый увидел небесные тела в усовершенствованный телескоп зимой 1610 года. Изначально он принял их за звезды, но потом выяснил, что имеет дело с объектами совсем иного рода. Это стало величайшим открытием. Галилей не дал своим «детям» имен, обозначив их номерами, согласно близости к Юпитеру. В результате Европа получила название лишь в середине XX века. Спутник носит имя дочери короля Тира, любовницы бога Зевса, впоследствии ставшей королевой Крита.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '4,8017 × 10^22 кг',
      },
      {
        key: 'Диаметр',
        value: '3122 км',
      },
      {
        key: 'Плотность',
        value: '3,014±0,05 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -223 до -163 °C',
      },
    ],
    intrestingFactsList: [
      'Сегодня, когда обнаружено много новых спутников Юпитера, Европу оттеснили на 6-е место по удаленности. Она расположена на расстоянии около 61 тыс. км от своей планеты.',
      'Орбитальный путь Европы практически круглый, на него уходит 3,6 земных дня, что совпадает с собственным периодом вращения. Спутник постоянно «смотрит» одной стороной на Юпитер.',
      'Гравитация, создаваемая двумя соседями — Ио и Ганимедом — приводит к колебаниям объекта, а приближенность и удаленность от планеты сопровождается приливами.',
      'Европа — одно из самых гладких небесных тел. На ее поверхности мало гор и кратеров.',
      'Несмотря на то, что возраст спутника около 4,5 млрд. лет, верхний слой его поверхности остается молодым и активным, составляя от 20 до 170 млн. лет.',
      'Ученые предполагают, что внутри, под горами, располагаются теплые океанические воды. Но эта гипотеза достаточно спорна, ведь внешняя кора льда на Европе имеет толщину до 30 км.',
      'Однако многие ученые считают, что Европа имеет достаточный потенциал для поиска жизни, которая может существовать в предполагаемом океане. Более того, она рассматривается даже в качестве объекта колонизации в отдаленном будущем.',
    ],
  },
  {
    img: Ganymede,
    undertext: 'Ганимед',
    fact: 'Спутник Юпитера',
    description:
      'Ганимед, самый большой спутник Юпитера, был найден великим итальянским астрономом Г. Галилеем в 1610 году, одновременно с тремя своими собратьями. С тех пор 4 небесных тела называют «лунами Галилея». Претендентом на открытие выступал и немецкий ученый С. Марий. Он утверждал, что нашел спутники годом раньше Галилея, но представить доказательства не смог.Первооткрыватель обозначил найденные спутники номерами, хотя другие астрономы (в том числе С. Марий и И. Кеплер) предлагали варианты названий. Один из них, связанный с именами приближенных Юпитера (в греч. мифологии Зевса), был официально принят, но лишь в начале ХХ века. Ганимед — единственный спутник с мужским именем. Согласно легенде, Зевс полюбил сына троянского царя Ганимеда и, обернувшись орлом, унес его к себе на Олимп.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,4819 × 10^23 кг',
      },
      {
        key: 'Диаметр',
        value: '5268 км',
      },
      {
        key: 'Плотность',
        value: '1,936 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -203 до -121 °C',
      },
    ],
    intrestingFactsList: [
      'Спутник удален от планеты в среднем на 1 млн. км и обходит ее за 7,1 земных дней.',
      'Небесное тело включает ядро из расплавленного железа, горную мантию и толстую (850–950 км) ледяную оболочку',
      'Есть гипотеза, что под ледяным слоем находится океан, жидкость в котором сохраняется за счет огромного давления.',
      'На поверхности Ганимеда присутствуют два вида рельефа. Древние участки темного цвета покрыты глубокими впадинами (кратерами). Более молодые и светлые образовались в результате тектонических процессов.',
      'Предполагается, что около 4 млн. лет назад спутник подвергался мощной атаке астероидов.',
      'Ганимед обладает слабой атмосферой с присутствием кислорода, образованного таянием льда.',
      'Световое излучение над спутником слабое, но есть и яркие пятна, создающие эффект северного сияния.',
      'Уникальность Ганимеда состоит в наличии небольшой магнитосферы, соединенной с магнитосферой Юпитера. Это в определенной степени подтверждает гипотезу о присутствии подземного океана.',
    ],
  },

  {
    img: Mimas,
    undertext: 'Мимас',
    fact: 'Спутник Сатурна',
    description:
      'Сатурн обладает большим семейством спутников: на сегодня известно более шестидесяти сателлитов планеты. Один из них — Мимас — привлекает и пугает одновременно. Причиной стало его поразительное внешнее сходство со Звездой Смерти из культового сериала Дж. Лукаса «Звездные войны». Спутник был найден в 1789 году английским астрономом У. Гершелем, почти одновременно с еще одной луной Сатурна — Энцеладом. Название в честь древнегреческого титана Мимаса, погибшего в битве с богами Олимпа, придумал сын первооткрывателя Джон в 1847 году.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '3,7493 × 10^19 кг',
      },
      {
        key: 'Диаметр',
        value: '396,4 км',
      },
      {
        key: 'Плотность',
        value: '1,149 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: 'от -220 до -170 °C',
      },
    ],
    intrestingFactsList: [
      'Спутник удален от Сатурна в среднем на 185,5 тыс. км. Находясь в гравитационном блоке, он всегда обращен одной стороной к своей планете.',
      'Орбита Мимаса имеет почти идеально круговую форму, отклонение ничтожно мало. Полный оборот вокруг Сатурна совпадает с собственным осевым оборотом, занимая около 23 земных часов.',
      'Спутник находится в резонансе с двумя другими сателлитами Сатурна — Тефией и Пандорой. Он считается самым маленьким небесным телом, которому удалось достичь гравитационной стабильности. Если бы Мимас вращался вокруг Солнца, то вполне мог попасть в список карликовых планет.',
      'Поверхность небесного тела почти полностью покрыта следами метеоритных атак — кратерами. На сегодня их насчитывается около сорока, диаметром от 20 до 40 км.',
      'После полета к Сатурну космического аппарата «Кассини», исследовавшего и его спутники, возникла гипотеза о существовании на Мимасе подземного океана. Но пока она мало подтверждена фактами.',
    ],
  },
  {
    img: Phobos,
    undertext: 'Фобос',
    fact: 'Спутник Марса',
    description:
      'Фобос (один из 2-х спутников знаменитого Марса) отличается от всех остальных наиболее близким расположением к своей планете. Ученые давно пытались отыскать марсианских спутников. Их присутствие именно в двойном количестве предполагал еще в 17 веке известный астроном И. Кеплер. А писатель Дж. Свифт заранее описал открытие в одном из томов «Путешествий Гулливера», изданном в 1726 году. Однако Фобос был открыт лишь летом 1877 года американским ученым А. Холлом, совершавшим наблюдения в обсерватории города Вашингтона. Название позаимствовано из древнегреческих мифов. Фобос (что означает «страх») был сыном воинственного бога Ареса и верным соратником отца во всех битвах.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,072 × 10^16 кг',
      },
      {
        key: 'Диаметр',
        value: '22,2 км',
      },
      {
        key: 'Плотность',
        value: '1,876 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-40 °C',
      },
    ],
    intrestingFactsList: [
      'Несмотря на малые размеры (его средний диаметр — всего около 22 км), Фобос является самым крупным спутником Марса.',
      'Он расположен очень близко к планете: на расстоянии, не превышающем 9400 км. Это в 40 раз меньше, чем между Луной и Землей.',
      'Возможно, раньше Фобос был астероидом, притянутым магнитным полем Марса. В пользу этой теории говорит и его неправильная, далекая от сферической, форма.',
      'По сути, Фобос — это большой кусок камня с глубокими бороздами и кратерами. Наиболее крупный из них (диаметром около 10 км) назвали Стикни, в честь супруги первооткрывателя. Другие заметные части поверхности носят имена ученых и персонажей из романов Дж. Свифта.',
      'На спутнике отсутствует атмосфера и магнитное поле, а очень малая плотность говорит о том, что небесное тело имеет структуру с большим объемом пустот.',
      'Фобос имеет преимущественно серую окраску, это один из самых слабо отражающих свет небесных объектов.',
      'Ученые уверены, что через 40–50 млн. лет Фобос просто упадет на Марс, но еще задолго до этого будет разорван силой гравитации, перейдя известный предел Роша, составляющий 2 радиуса планеты.',
    ],
  },
  {
    img: Tefia,
    undertext: 'Тефия',
    fact: 'Спутник Сатурна',
    description:
      'Французскому астроному, директору обсерватории Парижа Дж. Кассини, удалось обнаружить четыре спутника Сатурна. Одним из них стала Тефия, найденная профессором в 1684 году. Ученый называл свои открытия «звездами Людовика», в честь короля Франции. А настоящее имя придумал Дж. Гершель, уже в 1847 году. В мифологии древних греков Тефия была супругой бога Океана и матерью всех морей и рек. Поэты часто использовали ее имя в качестве «морского» эпитета.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '6,1745 × 10^20 кг',
      },
      {
        key: 'Диаметр',
        value: '1060 км',
      },
      {
        key: 'Плотность',
        value: '0,984 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-187 °C',
      },
    ],
    intrestingFactsList: [
      'Она удалена от Сатурна почти на 295 тыс. км, занимая 13-ю позицию в общем списке и 3-ю — среди основных спутников.',
      'Тефия облетает свою планету за 1,9 земных дней. Она всегда повернута одной стороной к Сатурну.',
      'Из-за ледяного слоя поверхность сателлита светлая и яркая. Лишь в некоторых местах есть красноватые и темные участки. Его альбедо (отражающая способность) составляет 10,2.',
      'Ученые полагают, что Тефия родилась из планетарной туманности: газ и космическая пыль сливались до тех пор, пока не сформировали небесное тело.',
      'Гравитационные силы Сатурна защитили близко расположенный спутник от сильных атак метеоритов, но он все же получил несколько значительных ударов.',
      'У ученых есть две версии появлении колоссальной трещины. Одни считают, что это следствие падения космического тела, другие связывают его с застыванием подземных вод.',
      'Помимо этих значительных образований на Тефии много холмов, небольших впадин. Встречаются и плоские участки.',
      'Все достопримечательности рельефа названы в честь знаменитых мест и героев гомеровской поэмы «Одиссея».',
    ],
  },
  {
    img: Titan,
    undertext: 'Титан',
    fact: 'Спутник Сатурна',
    description:
      'Титан, самый большой спутник Сатурна, обнаружил в 1655 году голландский ученый Х. Гюйгенс. Вдохновленный находками Галилея, он разработал собственный телескоп и с его помощью сделал открытие. Более двухсот лет спутник оставался безымянным. Первооткрыватель называл его просто луной Сатурна, а другие астрономы — спутником Гюйгенса. После того как обнаружили другие небесные тела, сопровождающие планету, они стали обозначаться римскими цифрами. Титан получил номер «IV», согласно своей удаленности от Сатурна. Лишь в середине XIX века Дж. Гершель предложил назвать 7 известных к тому времени спутников именами родственников греческого бога Кроноса (в римском варианте — Сатурна). Так Титан получил свое современное имя.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,3452 × 10^23 кг',
      },
      {
        key: 'Диаметр',
        value: '5152 км',
      },
      {
        key: 'Плотность',
        value: '1,8798 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '-179,5 °C',
      },
    ],
    intrestingFactsList: [
      'Титан — не только крупнейший спутник своей планеты. Он стоит на 2-й позиции во всей системе, уступая в размерах только Ганимеду.',
      'В среднем Титан удален от своей планеты на 1 млн. 220 тыс. км. Облет вокруг нее занимает почти 16 земных дней (период, аналогичный обороту спутника вокруг своей оси).',
      'Поверхность небесного тела состоит из слоев льда и камня примерно в равных пропорциях, что доказывает показатель плотности в 1,9 г/см3. Внутри находится каменное ядро.',
      'Титан — единственный из спутников планеты, имеющий плотную атмосферу с большим содержанием азота. Также в ней присутствуют этан, водород и метан, образующие облака.',
      'Наличие атмосферы долгое время не позволяло изучить рельеф спутника. Детально рассмотреть его получилось лишь с помощью аппарата «Кассини», запущенного в 2004 году.',
      'На Титане обнаружили довольно большие метановые моря и озера, сконцентрированные возле полюсов. Это единственное (не считая Земли) небесное тело, где имеется поверхностная жидкость. В целом она занимает небольшое пространство, но исследователи предполагают и наличие подземного океана из воды и аммиака.',
      'По многим параметрам Титан похож на Землю ранних стадий развития, поэтому ученые вполне допускают существование на нем простейших форм жизни (особенно в океане).',
    ],
  },
];
