import sun from '../assets/images/cosmosPage/stars/Sun.png';
import zetaAft from '../assets/images/cosmosPage/stars/Zeta_aft.png';
import sirius from '../assets/images/cosmosPage/stars/Sirius.png';
import betelgeuse from '../assets/images/cosmosPage/stars/Betelgeuse.png';
import altair from '../assets/images/cosmosPage/stars/Altair.png';
import acrux from '../assets/images/cosmosPage/stars/Acrux.png';

export const starSet = [
  {
    img: sun,
    undertext: 'Солнце',
    fact: 'Жёлтая звезда',
    description:
      'Не секрет, что Солнце — источник всего живого на Земле. Ближайшая к нам Звезда на протяжении почти 5 миллиардов лет помогает нашей планете, согревая своим теплом, наполняя нашу жизнь светом, без которого мы не смогли бы существовать. Как ей это удается? Ответ достаточно прост. Солнце состоит из водорода, гелия и электронов. Постоянные термоядерные реакции, происходящие в ядре, под воздействием температуры в 13,6 млн. градусов по Цельсию, заставляют водород превращаться в гелий, при этом выделяя тепло и свет, которые для нас так необходимы. А что Вы знаете о рождении этой звезды? Cложно представить, что 5 миллиардов лет назад не было ни звезд, ни планет, ни Солнца, были только молекулы водорода и холодная Вселенная. Под воздействиями сил гравитации молекулы водорода «скрутились» в горячий огненный шар, именуемый сегодня Солнцем, а центробежная сила придала форму шара этому новообразованию.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,98892 × 10^30 кг',
      },
      {
        key: 'Диаметр',
        value: '1392000 км',
      },
      {
        key: 'Плотность',
        value: '1,41 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '5505 °C',
      },
    ],
    intrestingFactsList: [
      'Первая «профессиональная» фотография Солнца была сделана французскими физиками Л.Фуко и И.Физо 2 апреля 1845 г.',
      'Солнце — не единственная звезда, вокруг которой вращаются все планеты: есть и другие звезды с вращающимися вокруг них планетами.',
      'Свет от Солнца до Земли добирается за 8,3 минуты.',
      'За 1 секунду термоядерной реакции сгорает 5 миллионов тонн водорода.',
      'Звезда не имеет твердой поверхности, а состоит из слоев.',
      'Расстояние от Солнца до Луны превосходит в 400 раз прямую от Луны до Земли, благодаря этому можно наблюдать солнечное затмение.',
      'Солнечный ветер представляет собой выброс ионизированных частиц с поверхности «короны», выбрасываемых со скоростью в 400 км/с во всех направлениях. При попадании солнечного ветра на магнитное поле Земли мы наблюдаем удивительное зрелище — Северное сияние.',
      'Конец света, согласно научным исследованиям, состоится не раньше чем через 5 миллиардов лет, когда на Солнце закончится водород.',
    ],
  },
  {
    img: sirius,
    undertext: 'Сириус',
    fact: 'Белая звезда',
    description:
      'Сириус – одна из самых ярких звезд на нашем небосклоне полна тайн и загадок. Имя Сириус дрейфует из столетия в столетие и достаточно часто фигурирует в истории. Какие знания о Сириусе сегодня мы можем передать нашим потомкам? Сириус входит в Созвездие Большого Пса, хотя ранее считалось, что он принадлежит Большой Медведице, но возраст звезды указал на обратное. Больше в 2 раза и ярче в 22 раза Солнца: он виден на небосклоне невооруженным взглядом.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '~2 × 10^24 кг',
      },
      {
        key: 'Диаметр',
        value: '2370000 км',
      },
      {
        key: 'Плотность',
        value: '~0,25 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '9000 °C',
      },
    ],
    intrestingFactsList: [
      'Сириус — двойная звезда. Его «спутник» был обнаружен в 1844 году и получил название Сириус В.',
      'Египетские пирамиды были построены так, что свет звезды озарял их алтари. Удивительно, но именно по этому признаку люди древней цивилизации определяли разлив Нила.',
      'Коран, написание которого датируется 7 веком, передает систему Сириуса такой, какой она была изучена только в 19 веке.',
      'Сириус тесно связан с эзотерикой. Существует поверье, что связь с потусторонним миром напрямую поступает на Землю именно с этой звезды.',
    ],
  },
  {
    img: betelgeuse,
    undertext: 'Бетельгейзе',
    fact: 'Красная звезда',
    description:
      'Звезда Бетельгейзе (иначе — альфа Ориона) находится в правом плече созвездия Ориона, расположенного в Северном полушарии. Это 2-я по яркости звезда в астеризме, и 10-я — во всем небе. Бетельгейзе относится к красным сверхгигантам поистине фантастического размера: ее диаметр почти в 900 раз больше солнечного, а светимость сильнее в 120 тыс. раз. Звезда удалена от Земли более чем на 640 световых лет. В сентябре-марте ее можно наблюдать практически с любого места на планете. Летом же она прячется за Солнцем, становясь невидимой.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '16,5−19 M',
      },
      {
        key: 'Диаметр',
        value: '1500 млн. км',
      },
      {
        key: 'Плотность',
        value: '1,2e-8 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '3300 °C',
      },
    ],
    intrestingFactsList: [
      'Бетельгейзе, в слегка искаженном переводе с арабского — «рука Ориона». Но в разных странах и культурах ее называли по-своему. Индусы, видевшие в созвездии антилопу, именовали его «Баху», китайцы называли «Шенксия» — четвертая звезда, японцы — «Хайке-боши», так как она была символом клана Хайке.',
      'Ученые определяют возраст звезды в 10 млн. лет и полагают, что сначала она была горячей звездой голубого цвета с массой, превышающей солнечную примерно в 20 раз.',
      'Бетельгейзе — молодое небесное тело, но оно уже практически израсходовало свой запас топлива. В настоящее время внешние слои сжимаются и расширяются, температура колеблется от 3100 до 4500 К. Звезда быстро теряет массу, двигаясь с ускорением в 30 км/с и выбрасывая большие объемы газа.',
      'По расчетам ученых, Бетельгейзе подошла к завершению своего эволюционного цикла. В ближайший миллион лет произойдет взрыв, и образуется сверхновая звезда.',
    ],
  },
  {
    img: zetaAft,
    undertext: 'Дзета кормы',
    fact: 'Голубая звезда',
    description:
      'Вселенная умеет удивлять, и Дзета Корма — яркое тому подтверждение. Эта звезда еще совсем недавно (до 18 века) входила в состав созвездия Корабль Арго, но, в результате деятельности Николя Луи де Лакайль, Корабль Арго «разбился» на три отдельных созвездия и Корма стала самым крупным из них. Примечательно то, что ни одно из трех созвездий не имеет альфа и бета звезд. Наос — самая яркая звезда созвездия Корма и самая необычная по своим характеристикам и явлениям.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '56,1 M',
      },
      {
        key: 'Диаметр',
        value: '15,312 млн. км',
      },
      {
        key: 'Плотность',
        value: '1,5е-7 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '42 000 °C',
      },
    ],
    intrestingFactsList: [
      'Помимо официального названия Дзета Корма существует и второе — Наос.',
      'Дзета Корма считается одной из самых горячих звезд в нашей галактике.',
      'Масса «тела» звезды превышает массу Солнца в 40 раз.',
      'Звезда имеет орбиту, которая в будущем может способствовать возникновению жизни существ, аналогичных обитающим на Земле.',
      'Самый мощный звездный ветер принадлежит именно этой звезде.',
      'Темные пятна на звезде провоцируют возникновение «смерча» в звездном ветре, что не «переживает» ни одна звезда в галактике.',
      'По предварительным подсчетам через 2 миллиона лет звезда достигнет своего апогея и взорвется.',
      'В средней полосе звезда не видна, однако в южной части ее можно увидеть невооруженным глазом, особенно в зимний период.',
    ],
  },
  {
    img: altair,
    undertext: 'Альтаир',
    fact: 'Белая звезда',
    description:
      'Свое название Альтаир получил благодаря арабским ученым. В переводе с арабского его имя обозначает Парящий Орел. Сама же звезда входит в созвездие Орла и считается самой яркой точкой этого созвездия. Таинственная звезда близко расположена от Земли. Она по сей день не подпускает к себе ученых. Современная аппаратура не может детально изучить свойства и особенности Альтаира.  Примечательно то, что люди, в гороскопе которых наблюдается эта звезда, отличаются силой духа, выносливостью, честностью. Возможно, это связано с легендами, которые окутывают знаменитую, но недоступную звезду небосклона.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '1,7 M кг',
      },
      {
        key: 'Диаметр',
        value: '2,370 млн. км',
      },
      {
        key: 'Плотность',
        value: '1,2е-8 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '7800 °C',
      },
    ],
    intrestingFactsList: [
      'Альтаир имеет форму эллипса как следствие слишком большой скорости вращения.',
      'Альтаир не имеет четкой структуры окрашивания: неоднородный голубовато-белый оттенок поверхности подтвержден снимками.',
      'Альтаир имеет едва видные диски, фото которых было получено в 2005 году, раньше, чем фото самой звезды.',
      'Скорость вращения вокруг оси составляет 6–10 часов, в то время как Солнцу требуется на это 25 суток.',
      'Альтаир меняет свой радиус в зависимости от угла расположения на небе.',
      'Согласно легенде, созвездие Орла появилось от рук Зевса, опечаленного убийством любимой птицы Гераклом.',
      'Альтаир — одна из немногих звезд, которой интересуются ученые, но не могут получить достоверные данные из-за ее особенностей.',
      'Первая качественная фотография формы и поверхности была сделана в 2007 году.',
      'Температура тела Альтаира до сих пор доподлинно не известна. Согласно теории, температура, сила тяжести и яркость меняются к экватору из-за быстрого вращения и меняющегося географического положения.',
      'Альтаир окружен ярким свечением — Сияющий Глаз. Излучения этой туманности передают на телескопы радужные оттенки, что говорит о необычайно красивом и завораживающем зрелище, происходящем внутри созвездия.',
      'У японцев Альтаир считается покровителем влюбленных, которые готовы на жертвы и отчаянные поступки ради любви.',
    ],
  },
  {
    img: acrux,
    undertext: 'Акрукс',
    fact: 'Бело-голубая звезда',
    description:
      'Акрукс — южная звезда, ярчайшая представительница созвездия Южный Крест. Иначе ее называют Полярной звездой и ориентируются, когда путешествуют. Она помогает выбрать южное направление. Уникальность названия звезды в полном отсутствии мифологического происхождения. На латыни крест звучит как «крукс», а буква «А» присоединилась от слова «альфа», чем и является она в созвездии, отсюда Акрукс (альфа Крукс). Связь с путешественниками приписывали звезде давно, португальцы ее называют звездой Магеллана, и она присутствует на флагах некоторых стран. Новая Зеландия и Самоа, Австралия и Бразилия отображают на своих флагах красавицу Акрукс. Китайцы ее почитают и называют второй звездой Креста.',
    characteristicsList: [
      {
        key: 'Масса',
        value: '14+10 / 13 M',
      },
      {
        key: 'Диаметр',
        value: '~ км',
      },
      {
        key: 'Плотность',
        value: '2,3е-4 г/см³',
      },
      {
        key: 'Температура поверхности',
        value: '27 700 °C',
      },
    ],
    intrestingFactsList: [
      'Хорошо видна Акрукс обитателям южного полушария. Они лучше всего могут наблюдать за ней в апреле — июне.',
      'Звезда находится в 320 световых лет от Земли и представляет собой сине-белый гигант, который превышает массу Солнца почти в 18 раз, а по яркости превосходит его в 25 тысяч раз.',
      'В созвездии Южный Крест есть Альфа-2, которую называют синим карликом. Масса звезды больше солнечной почти в 16 раз, а яркость выше в 16 тысяч.',
      'Возраст звезды Акрукс — около 11 миллионов лет.',
      'Скорость вращения у двух главных звезд Южного Креста отличается. Альфа-1 вращается со скоростью 120 км в секунду, а Альфа-2 развивает скорость до 200 км в секунду.',
    ],
  },
];
